# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви", "арбуз"]

long_name=len(fruits[0])
i=1

for fruit in fruits:
    if len(fruit)>long_name:
        long_name=len(fruit)

for el in fruits:
    print(i,'. ',' '*(long_name-len(el)),el)
    i+=1

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
